<?php
$dep = array(
    array('id' => 1,  'parent' => 0,  'name' => 'Институты'),
    array('id' => 2,  'parent' => 0,  'name' => 'Высшие школы'),
    array('id' => 3,  'parent' => 1,  'name' => 'Гуманитарный институт'),
    array('id' => 4,  'parent' => 1,  'name' => 'Инженерно-строительный институт'),
    array('id' => 5,  'parent' => 1,  'name' => 'Институт компьютерных наук и технологий'),
    array('id' => 6,  'parent' => 5,  'name' => 'Кафедра "Компьютерные интеллектуальные технологии"'),
    array('id' => 7,  'parent' => 2,  'name' => 'Высшая школа биотехнологии и пищевых технологий'),
    array('id' => 8,  'parent' => 2,  'name' => 'Высшая школа международных образовательных программ'),
    array('id' => 9,  'parent' => 2,  'name' => 'Высшая инженерная школа'),
    array('id' => 10, 'parent' => 0,  'name' => 'Филиалы'),
    array('id' => 11, 'parent' => 10, 'name' => 'Институт ядерной энергетики (филиал ФГАОУ ВО "СПбПУ") г.Сосновый Бор'),
    array('id' => 12, 'parent' => 3,  'name' => 'Кафедра "Лингводидактика и перевод"'),
    array('id' => 13, 'parent' => 3,  'name' => 'Кафедра "Инженерная педагогика и психология"'),
    array('id' => 14, 'parent' => 3,  'name' => 'Кафедра "Международные отношения"'),
    array('id' => 15, 'parent' => 5,  'name' => 'Кафедра "Распределенные вычисления и компьютерные сети"'),
    array('id' => 16, 'parent' => 5,  'name' => 'Кафедра "Управление проектами"'),
    array('id' => 17, 'parent' => 5,  'name' => 'Кафедра "Измерительные информационные технологии"'),
    array('id' => 18, 'parent' => 4,  'name' => 'Кафедра "Водохозяйственное и гидротехническое строительство"'),
    array('id' => 19, 'parent' => 4,  'name' => 'Кафедра "Гидравлика"'),
    array('id' => 20, 'parent' => 4,  'name' => 'Кафедра "Гражданское строительство и прикладная экология"'),
);
?>